# Groupby

In [1]:
import pandas as pd

data = {
    "Classe": ["Júnior", "Júnior", "Pleno", "Pleno", "Sênior", "Sênior"],
    "Nome": ["Jorge", "Carlos", "Roberta", "Patrícia", "Bruno", "vera"],
    "Venda": [200, 120, 340, 124, 243, 350],
}

In [2]:
df = pd.DataFrame(data)

In [3]:
group = df.groupby("Classe")

In [4]:
group.sum(numeric_only=True)

        Venda
Classe
Júnior    320
Pleno     464
Sênior    593

In [5]:
group.mean(numeric_only=True)

        Venda
Classe
Júnior  160.0
Pleno   232.0
Sênior  296.5

In [6]:
df.groupby("Classe").min()

            Nome  Venda
Classe
Júnior    Carlos    120
Pleno   Patrícia    124
Sênior     Bruno    243

In [7]:
df.groupby("Classe").max()

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior     vera    350

In [8]:
df2 = df.__deepcopy__()

In [9]:
df2["Venda"] = [150, 432, 190, 230, 410, 155]

In [10]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      vera    155

In [11]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      vera    350

In [12]:
df3 = pd.concat([df, df2])

In [15]:
df3.groupby(["Classe", "Nome"]).sum()

                 Venda
Classe Nome
Júnior Carlos      552
       Jorge       350
Pleno  Patrícia    354
       Roberta     530
Sênior Bruno       653
       vera        505